In [2]:
import pandas as pd

In [3]:
dataframe = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],

        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"]
    }
)

In [4]:
dataframe

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [5]:
dataframe["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [6]:
ages = pd.Series([22, 35, 58], name="Age")

In [7]:
ages

0    22
1    35
2    58
Name: Age, dtype: int64

In [8]:
print(dataframe["Age"].max())
print(dataframe["Age"].mean())

58
38.333333333333336